#ifndef OSDETECTOR_H // Предпазител от многократно включване на хедър файла
#define OSDETECTOR_H // Дефиниране на предпазителя за хедър файла

#include <wx/wx.h> // Включване на wxWidgets библиотека, необходима за графичния интерфейс

class OSDetector
{       // Дефиниция на клас за откриване на операционна система
public: // Публичен интерфейс на класа
    enum class OS
    {            // Изброяване на поддържаните операционни системи
        Windows, // Операционна система Windows
        MacOS,   // Операционна система MacOS
        Linux,   // Операционна система Linux
        Unknown  // Неизвестна операционна система
    };

    OS GetCurrentOS();         // Метод, който връща текущата операционна система
    wxString GetOSName(OS os); // Метод, който връща името на операционната система като текстов низ
};

#endif // OSDETECTOR_H // Край на предпазителя за хедър файла